Rebar Sketch is empty. Can't create Rebar.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RebarEmptySketchError { get; }
  Visual Basic
Public Shared ReadOnly Property RebarEmptySketchError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RebarEmptySketchError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace